# Дано положительное двузначное число. Найдите число десятков в нем.

n = int(input())
k = n // 10
print(k)
