# Дано натуральное число. Выведите его последнюю цифру.

n = int(input())
k = n % 10
print(k)
