# Напишите программу, которая считывает два целых числа A и B и выводит наибольшее значение из них. Числа — целые от 1 до 1000.

n1 = int(input())
n2 = int(input())
if n1 > n2:
    print(n1)
else:
    print(n2)
