# Дана строка, состоящая из слов, разделенных пробелами.
# Определите, сколько в ней слов.

s = input()
quant = s.count(' ') + 1
print(quant)
