# Выведите все элементы списка с четными индексами (то есть A[0], A[2], A[4], ...).

print(*input().split()[::2])
